# !/usr/bin/python
# -*- coding: utf-8 -*-
# 使用 utf-8 編譯
# 如果是使用 run code 有可能還是會有問題
########################################
# 基本上是觀念類
# 內容 (可以用以下關鍵字搜尋)
    # 各種型別
    # 數學運算子
    # 比較運算子
    # if else 語法
    # Casting
    # 連動
    # list
    # Tuple

########################################


# # 這一份是用來 檢測是否有學會 以及 提醒需要注意的地方
# # 坑 : 要注意如何使用 或就不要用這種用法
# # 使用方法 : 看區段程式 看會跑出什麼 決定好答案後再打開註解 並且執行 驗證是否與自己的答案相同(包括)
# # 答案必須一字不差 包括 中括號、小括號、引號 且答案也有可能是 : 會跳ERROR

# # print
# print("123")

# #------------------------------------
# # 執行
# # ctrl + f5

# #------------------------------------
# # 註解 快速鍵: 1.滑鼠選取要註解的行 2.ctrl + / 
# print("123")

# #------------------------------------
# # Assign 指定 
# x = 5
# print(x)

# #------------------------------------
# # Assign 指定 覆寫
# x = 5
# x = 6
# print(x)

# #------------------------------------
# # Assign 指定 未指定的變數名稱
# x = 5
# print(xx)
# print("會印這行嗎?")
# print(x)

# # 各種型態 type 1 
# #------------------------------------
# # boolean
# x = True
# print(x)
# print(type(x))

# #------------------------------------
# # int
# x = 1
# print(x)
# print(type(x))

# #------------------------------------
# # float
# x = 1.0
# print(x)
# print(type(x))

# #------------------------------------
# # 數學運算子 運算 加法 減法 乘法 除法 整除法 餘數 次方 執行優先順序
# x = 72 - 6 * 6 / 3 + 3 - 3
# print(x)
# #------------------------------------
# x = 6 * 3 ** 2 
# print(x)
# #------------------------------------
# x = 3 ** 2 * 6
# print(x)
# #------------------------------------
# x = 6 % 3 ** 2 
# print(x)
# #------------------------------------
# x = 2 ** 6 % 3
# print(x)
# # 建議用括號 就不需要背

# #------------------------------------
# # 數學運算 不同型別
# x = 5.0 * 5
# print(x)

# #------------------------------------
# # python 沒有 ++ --
# i = 1
# i++
# print(i)

# #------------------------------------
# # 布林運算 
# print( True and False)
# print( True or False)

# #------------------------------------
# # 布林運算 執行優先順序 坑
# print( True and False or True and True)
# print( True or True and False or False)
# # 建議還是用括號 就不需要背

# #------------------------------------
# # 比較運算子 
# print( 5 > 5 )

# #------------------------------------
# # 比較運算子 連續比較 坑
# print( 9 > 8 > 7 )  #1
# print( (9 > 8) > 7 )  #2
# # 建議把 #1 寫成以下形式
# print( (9 > 8) and (8 > 7) )  #3

# #------------------------------------
# # 比較運算子 字串比較
# print("b" > "a")
# print("B" > "a")

# #------------------------------------
# # 比較運算子 不同型別比較 1 坑
# x = 5
# y = "5"
# print(x == y)

# #------------------------------------
# # 比較運算子 5 不同型別比較 2 坑
# x = 5
# y = 5.0
# print(x == y)

# #------------------------------------
# # 比較運算子 float比較 1 坑
# x = 0.1242
# y = 124.2 / 1000
# print(x == y)

# #------------------------------------
# # 比較運算子 float比較 2 坑
# x = 0.1241
# y = 124.1 / 1000
# print(x == y)
# # 因此測試的比較永遠都要用 int

# #------------------------------------
# # if else 1
# if True :
#     print("會印這行嗎?")
# else :
#     print("那會印這行嗎?")
# print("這裡呢?")

# #------------------------------------
# # if else 2
# if False :
#     print("會印這行嗎?")
# else :
#     print("那會印這行嗎?")
# print("這裡呢?")

# #------------------------------------
# # if else elif
# i = 3
# if i == 1 :
#     print("i == 1")
# elif i == 3 :
#     print("i == 3")
# else :
#     print("else")
# print("這裡?")

# #------------------------------------
# # Casting 轉型
# x = 5.0
# y = int(5)
# print(x)
# print(y) 

# #------------------------------------
# # Casting 轉型 資料喪失 坑
# x = 5.5
# y = int(x)
# print(x)
# print(y) 

# # 各種型態 type 2 陣列類
# #------------------------------------
# # string 
# x = "123"+'456'
# print(x)

# #------------------------------------
# # string 不可更改
# str1 = 'hello python'
# str1[0] = 'y'

# #------------------------------------
# # string 不會連動 坑
# str1 = 'hello python'
# str2 = str1
# str2 += ' journey'
# print(str2)
# print(str1)

# #------------------------------------
# # list 輸出
# x = [1,2,3]
# print(type(x))
# print(type(x[0]))
# print(type(x[1]))
# print(type(x[2]))
# print(x)

# #------------------------------------
# # list 內各項可不同型態
# x = [1,"2",3.0]
# print(type(x))
# print(type(x[0]))
# print(type(x[1]))
# print(type(x[2]))
# print(x)
# print(x[0])

# #------------------------------------
# # list 取值
# x = "12345"
# print(x[:2])
# print(x[2:])
# print(x[2:-1])

# #------------------------------------
# # list 會連動 坑
# # 跟 string 不會連動 做比較
# str1 = [1,2,3]
# str2 = str1
# str2 += [4,5]
# print(str2)
# print(str1)

# # ------------------------------------------------------
# # list 加法順序有差
# ll = [1,2,3]
# ll2 = [4,5,6]

# print(ll+ll2)
# print(ll2+ll)

# # ------------------------------------------------------
# # +=
# ll = [1,2,3]
# ll2 = [4,5,6]

# ll2 += ll
# print(ll2)
# # 因此不推薦使用 += 
# # 程式碼易讀性較差

# #------------------------------------
# # Tuple 輸出
# x = (1,"2",3.0)
# print(x)
# print(x[0])

# #------------------------------------
# # Tuple 拆開
# x = (1,"2",3.0)
# x1, x2, x3 = x
# print(x1)
# print(x2)
# print(x3)

# #------------------------------------
# # Tuple 不會連動 坑
# # 跟 list 會連動 比較
# str1 = (1,2,3)
# str2 = str1
# str2 += (4,5)
# print(str2)
# print(str1)

# #------------------------------------
# # while
# x = 1
# while True :
#     x = x+1
#     print(x)
# # ctrl + c 終止程式

# #------------------------------------
# # while break 不夠
# while True:
#     print("第一個 while")
#     while True:
#         print("第二個 while")
#         break
# # ctrl + c 終止程式
# # 有一個 while 就至少會搭配一個 break
